blipk.csharp
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc-icons
chrisatwindsurf.csharpextension
ckob.lazydotnet
daelmaak.next-error
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot-chat
gruntfuggly.todo-tree
jakubkozera.csharp-dev-tools
joeberria.statusbarerror
kenan-salar.calmppuccin-vscode
kide.kide-csharp
kide.kide-test-explorer
koda.koda
ms-dotnettools.vscode-dotnet-runtime
selemondev.shadcn-vue
vincaslt.highlight-matching-tag
vue.volar
vunguyentuan.vscode-css-variables
wayou.vscode-todo-highlight
yoavbls.pretty-ts-errors
