blipk.csharp
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc-icons
chrisatwindsurf.csharpextension
ckob.lazydotnet
daelmaak.next-error
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot-chat
haloscript.astyle-lsp-vscode
joeberria.statusbarerror
kenan-salar.calmppuccin-vscode
linyuansup.namespace-autocompletion
ms-dotnettools.vscode-dotnet-runtime
myriad-dreamin.tinymist
nromanov.dotrush
patcx.vscode-nuget-gallery
selemondev.shadcn-vue
usernamehw.errorlens
vincaslt.highlight-matching-tag
vue.volar
vunguyentuan.vscode-css-variables
yoavbls.pretty-ts-errors
