adrianwilczynski.add-reference
anderseandersen.html-class-suggestions
be5invis.vscode-custom-css
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc-icons
christian-kohler.path-intellisense
dbcode.dbcode
denizhandaklr.vscode-qwen-copilot
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
github.copilot-chat
icrawl.discord-vscode
ionutvmi.path-autocomplete
kenan-salar.calmppuccin-vscode
kide.kide-test-explorer
leo-labs.dotnet
linyuansup.namespace-autocompletion
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-vscode.vscode-websearchforcopilot
myriad-dreamin.tinymist
nguyentungsk2004.smart-close-tag
patcx.vscode-nuget-gallery
redhat.vscode-yaml
rimuruchan.vscode-fix-checksums-next
selemondev.shadcn-vue
usernamehw.errorlens
vue.volar
yzhang.markdown-all-in-one
